In [ ]:
"""
Second Highest Salary

Write a SQL query to get the second highest salary from the Employee table

# If there is no second highest salary, then the query should return null.
# If there are more than 1 record with the second highest salary, return only 1 record
"""

In [ ]:
"""testcase"""
# case_1
{"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100], [2, 200], [3, 300]]}}
# case_2: tied at highest, no second highest
{"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100], [2, 100]]}}
# case_3: tied at second highest
{"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100], [2, 50], [3, 50]]}}
# case_3: tied at highest, with second highest 
{"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100], [2, 100], [3, 50]]}}
# case_4: no second highest
{"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee(
Id  int(4) NOT NULL,
Salary int(8) NOT NULL,
PRIMARY KEY ('Id'));

INSERT INTO Person VALUES
(1, 100),
(2, 100),
(3, 50),
(4, 50);

In [ ]:
"""SQL solution"""
# pitfalls: return null when there is no result instead of an empty result
# MAX() returns null of the result is empty
SELECT MAX(Salary) AS SecondHighestSalary
FROM Employee
WHERE Salary < (SELECT MAX(Salary) FROM Employee)

# consider salary tied at highest
# order by limit 1 off 1, or row_number won't work, will need dense_rank() instead

# consider tied at second highest, will need limit 1 to return only 1 result when found

# SEELCT (your complete query) AS alias
# returns your record if only 1 is found
# returns null if no record is found
# fails if multiple records are found
SELECT
(SELECT Salary
FROM
(SELECT Salary, DENSE_RANK() OVER(ORDER BY Salary DESC) AS r
FROM Employee) AS f
WHERE f.r = 2
LIMIT 1) AS SecondHighestSalary

SELECT
(SELECT DISTINCT Salary
FROM
(SELECT Salary, DENSE_RANK() OVER(ORDER BY Salary DESC) AS r
FROM Employee) AS f
WHERE f.r = 2) AS SecondHighestSalary

In [5]:
"""pandas dataframe creation"""
import pandas as pd

emp1 = [(1, 100),
(2, 100),
(3, 50),
(4, 50)]

emp2 = [(1, 100),
(2, 100)]

Employee1 = pd.DataFrame(emp1, columns=['Id', 'Salary'])
Employee2 = pd.DataFrame(emp2, columns=['Id', 'Salary'])
Employee1.head()

   Id  Salary
0   1     100
1   2     100
2   3      50
3   4      50

In [18]:
Employee1['sal_rank'] = Employee1['Salary'].rank(method='dense', ascending=False)
Employee1[Employee1['sal_rank'] == 2]['Salary'].mean() # or .max(), .min()
ans = Employee1[Employee1['sal_rank'] == 2]['Salary'].mean() # or .max(), .min()
# this returns nan if no record is found
# in case we really need a 'null'
if pd.isna(ans): 
    SecondHighest ='null'
else:
    SecondHighest = ans
SecondHighest

50.0

In [19]:
Employee2['sal_rank'] = Employee2['Salary'].rank(method='dense', ascending=False)
ans = Employee2[Employee2['sal_rank'] == 2]['Salary'].mean() # or .max(), .min()
# this returns nan if no record is found
# in case we really need a 'null'
if pd.isna(ans): 
if pd.isna(ans): 
    SecondHighest ='null'
else:
    SecondHighest = ans
SecondHighest

<ipython-input-19-6161eab0b062>:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  ans = Employee2[Employee['sal_rank'] == 2]['Salary'].mean() # or .max(), .min()

'null'